// main.js

//=======================================================
// // приклад запросу через api
// import * as API from './api';

// API.searchTrending(3).then(res => {
//   // 3 - це сторінка запиту (page)
//   // тут рисуємо інтерфейс
//   console.log(res);
// });

// API.searchMovieId(76600).then(res => {
//   // 76600 - це id фільму для модалки
//   // тут рисуємо інтерфейс
//   console.log(res);
// });

// API.searchMovieTitle('Avatar', 2).then(res => {
//   // 'Avatar' - це з інпуту назва фільму, який шукаємо
//   // 2 - це сторінка запиту (page)
//   // тут рисуємо інтерфейс
//   console.log(res);
// });
//=======================================================
